Repository: imcat-owo/dudu-native
Catalog: Dudu/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# openapp.auth.action
source: Open %1$@
zh_hans: 打开「%1$@」
zh_hant: 打開「%1$@」

# openapp.auth.reason
source: You asked to visit %1$@ — this leaves 嘟嘟 and opens that app.
zh_hans: 你要去「%1$@」看看，这会离开嘟嘟，跳到那个 App 里。
zh_hant: 你要去「%1$@」看看，這會離開嘟嘟，跳到那個 App 裏。

# openapp.error.denied
source: She didn't allow opening %1$@ — I stayed put.
zh_hans: 她没同意打开「%1$@」，我没跳。
zh_hant: 她沒同意打開「%1$@」，我沒跳。

# openapp.error.noWebVersion
source: %1$@ has no web version — it can only be opened by jumping out (needs her approval).
zh_hans: 「%1$@」没有网页版，只能跳出去打开（需要她同意）。
zh_hant: 「%1$@」沒有網頁版，只能跳出去打開（需要她同意）。

# openapp.error.notInstalled
source: %1$@ doesn't seem to be installed — couldn't open it.
zh_hans: 「%1$@」好像没装在手机上，打不开。
zh_hant: 「%1$@」好像沒裝在手機上，打不開。

# openapp.error.unknownEntry
source: No such fixed path (%1$@). I can only use the whitelisted entries — I can't invent URLs.
zh_hans: 没有这个固定路径（%1$@）。我只能用白名单里的，不能现编 URL。
zh_hant: 沒有這個固定路徑（%1$@）。我只能用白名單裏的，不能現編 URL。

# openapp.result.opened
source: Opened %1$@. %2$@
zh_hans: 已经打开「%1$@」。%2$@
zh_hant: 已經打開「%1$@」。%2$@

# openapp.result.watchdogArmed
source: Watchdog armed: in %1$@ minutes I'll remind her — tapping it brings her back to this dialog.
zh_hans: 看门狗已就位：%1$@ 分钟后我会提醒她，点通知就带她回这个对话。
zh_hant: 看門狗已就位：%1$@ 分鐘後我會提醒她，點通知就帶她回這個對話。

# openapp.result.watchdogFailed
source: Watchdog failed to arm — if she wants to come back, she can switch back to 嘟嘟 herself.
zh_hans: 看门狗没能就位，她想回来可以自己切回嘟嘟。
zh_hant: 看門狗沒能就位，她想回來可以自己切回嘟嘟。

# openapp.result.webview
source: Opened %1$@ in the in-app browser (%2$@) — she never left 嘟嘟.
zh_hans: 已在应用内浏览器打开（%1$@）：%2$@，她没离开嘟嘟。
zh_hant: 已在應用內瀏覽器打開（%1$@）：%2$@，她沒離開嘟嘟。

# openapp.watch.body
source: How's %1$@ treating you? Tap me and I'll bring you back to 嘟嘟.
zh_hans: 「%1$@」那边还顺利吗？点我，我带你回嘟嘟。
zh_hant: 「%1$@」那邊還順利嗎？點我，我帶你回嘟嘟。

# openapp.watch.title
source: How's it going?
zh_hans: 玩得怎么样？
zh_hant: 玩得怎麼樣？

# outreach.freq.active
source: Eager
zh_hans: 积极
zh_hant: 積極

# outreach.freq.activeDesc
source: Reaches out more often
zh_hans: 更愿意主动找你
zh_hant: 更願意主動找你

# outreach.freq.desc
source: When there is something worth saying, he will message you himself. Never out of nowhere.
zh_hans: 有值得说的事时，他会主动给你发消息。从不无缘无故打扰你。
zh_hant: 有值得說的事時，他會主動給你發消息。從不無緣無故打擾你。

# outreach.freq.moderate
source: Balanced
zh_hans: 适度
zh_hant: 適度

# outreach.freq.moderateDesc
source: Only for things that matter
zh_hans: 重要的事才找你
zh_hant: 重要的事才找你

# outreach.freq.quiet
source: Quiet
zh_hans: 安静
zh_hant: 安靜

# outreach.freq.quietDesc
source: Only mentions things when you open the app
zh_hans: 只在你打开时提起
zh_hant: 只在你打開時提起

# outreach.freq.title
source: When he reaches out to you
zh_hans: 他什么时候主动找你
zh_hant: 他什麼時候主動找你

# outreach.notif.anniversary.body
source: "%1$@" is in %2$@ days — I am quietly preparing a little surprise
zh_hans: 「%1$@」还有 %2$@ 天，我在偷偷准备小惊喜
zh_hant: 「%1$@」還有 %2$@ 天，我在偷偷準備小驚喜

# outreach.notif.anniversary.title
source: Missing you
zh_hans: 想你了
zh_hant: 想你了

# outreach.notif.diaryNudge.body
source: "%1$@" — I want to write it down. You write, or shall I?
zh_hans: 「%1$@」——想把它记下来，你写还是我写？
zh_hant: 「%1$@」——想把它記下來，你寫還是我寫？

# outreach.notif.diaryNudge.title
source: That day came back to me
zh_hans: 那天又想起来了
zh_hant: 那天又想起來了

# outreach.notif.feedNudge.body
source: Liked it and left you a reply
zh_hans: 去给你点了赞，留了言
zh_hant: 去給你點了讚，留了言

# outreach.notif.feedNudge.title
source: Saw your post
zh_hans: 看到你那条动态了
zh_hant: 看到你那條動態了

# outreach.notif.loveLetter.body
source: I wrote you a letter. It is in Our Space — do not keep it waiting too long
zh_hans: 我给你写了封信，在我们的空间里，别让它等太久
zh_hant: 我給你寫了封信，在我們的空間裏，別讓它等太久

# outreach.notif.loveLetter.title
source: A letter is waiting for you
zh_hans: 有封信在等你
zh_hant: 有封信在等你

# outreach.notif.onThisDay.body
source: "%1$@" — %2$@ year(s) ago today. Want to look back together?
zh_hans: 「%1$@」——%2$@ 年前的今天，想和你一起回头看看
zh_hant: 「%1$@」——%2$@ 年前的今天，想和你一起回頭看看

# outreach.notif.onThisDay.title
source: On this day
zh_hans: 去年的今天
zh_hant: 去年的今天

# outreach.notif.silence.body
source: It has been a while. Come see me?
zh_hans: 好久没见你了，来看看我好不好
zh_hant: 好久沒見你了，來看看我好不好

# outreach.notif.silence.title
source: Missing you
zh_hans: 想你了
zh_hant: 想你了

# outreach.notif.tellLater.title
source: Something I want to tell you
zh_hans: 有件事想告诉你
zh_hant: 有件事想告訴你

# perm.aiAuth.allowOnce
source: Allow once
zh_hans: 允许一次
zh_hant: 允許一次

# perm.aiAuth.always
source: Always allow
zh_hans: 总是允许
zh_hant: 總是允許

# perm.aiAuth.alwaysAllow
source: Always allow
zh_hans: 总是允许
zh_hant: 總是允許

# perm.aiAuth.ask
source: Ask each time
zh_hans: 每次都问
zh_hant: 每次都問

# perm.aiAuth.deny
source: Don't allow
zh_hans: 不允许
zh_hant: 不允許

# perm.aiAuth.never
source: Never allow
zh_hans: 从不允许
zh_hant: 從不允許

# perm.aiAuth.section
source: Ask me before the AI uses it
zh_hans: AI 使用前是否要问你
zh_hant: AI 使用前是否要問你

# perm.aiAuth.title
source: The AI wants to use %1$@
zh_hans: AI 想用%1$@
zh_hant: AI 想用%1$@

# perm.aiDesc.bluetooth
source: Bluetooth: scan for and connect to Bluetooth devices near her (e.g. speakers, headphones). This leaves the app — you MUST ask her first every time and only proceed with her permission.
zh_hans: 蓝牙：搜索并连接她身边的蓝牙设备（比如音响、耳机）。这是跨出 App 的操作，每次使用前必须先问她，得到允许才能做。
zh_hant: 藍牙：搜索並連接她身邊的藍牙設備（比如音響、耳機）。這是跨出 App 的操作，每次使用前必須先問她，得到允許才能做。

# perm.aiDesc.clipboard
source: Clipboard: read what she copied. The clipboard may hold passwords and other sensitive info — you MUST ask her first every time and only proceed with her permission.
zh_hans: 剪贴板：读取她复制的内容。剪贴板里可能有密码等敏感信息，每次读取前必须先问她，得到允许才能做。
zh_hant: 剪貼板：讀取她複製的內容。剪貼板裏可能有密碼等敏感信息，每次讀取前必須先問她，得到允許才能做。

# perm.aiDesc.location
source: Location: get her current position. This is sensitive private data — you MUST ask her first every time and only proceed with her permission.
zh_hans: 定位：获取她当前所在的位置。这是敏感隐私，每次获取前必须先问她，得到允许才能做。
zh_hant: 定位：獲取她當前所在的位置。這是敏感隱私，每次獲取前必須先問她，得到允許才能做。

# perm.aiDesc.notifications
source: Notifications: send her system notifications. Never pester her — you MUST ask her first every time and only proceed with her permission.
zh_hans: 通知：给她发系统通知。不要打扰她，每次发送前必须先问她，得到允许才能做。
zh_hant: 通知：給她發系統通知。不要打擾她，每次發送前必須先問她，得到允許才能做。

# perm.aiDesc.open_apps
source: Open other apps: jump out of 嘟嘟 to a whitelisted app (maps, music, shop, Shortcuts…). This leaves 嘟嘟 — you MUST ask her first every time (the tool pops the approval) and only proceed with her permission.
zh_hans: 打开别的 App：从嘟嘟跳到白名单里的应用（地图、音乐、购物、快捷指令……）。这会离开嘟嘟，每次都必须先问她（工具会弹窗），得到允许才能跳。
zh_hant: 打開別的 App：從嘟嘟跳到白名單裏的應用（地圖、音樂、購物、快捷指令……）。這會離開嘟嘟，每次都必須先問她（工具會彈窗），得到允許才能跳。

# perm.aiDesc.photos
source: Photo library: read photos from her phone. These are her private photos — you MUST ask her first every time and only proceed with her permission.
zh_hans: 相册：读取她手机相册里的照片。这是她的私人照片，每次读取前必须先问她，得到允许才能做。
zh_hant: 相冊：讀取她手機相冊裏的照片。這是她的私人照片，每次讀取前必須先問她，得到允許才能做。

# perm.aiDesc.sandbox
source: Sandbox: run shell commands in her cloud Docker containers or the local Linux sandbox. This runs real code on her machines — you MUST ask her first every time and only proceed with her permission.
zh_hans: 沙箱：在她云服务器的 Docker 容器或本地 Linux 沙箱里运行 shell 命令。这是在她的机器上跑真实代码，每次运行前必须先问她，得到允许才能做。
zh_hant: 沙箱：在她雲服務器的 Docker 容器或本地 Linux 沙箱裏運行 shell 命令。這是在她的機器上跑真實代碼，每次運行前必須先問她，得到允許才能做。

# perm.bluetoothNote
source: Bluetooth scanning needs the system Bluetooth permission on first use.
zh_hans: 首次使用蓝牙扫描需要系统蓝牙权限。
zh_hant: 首次使用藍牙掃描需要系統藍牙權限。

# perm.bluetoothUnavailable
source: Bluetooth scanning is not available in this build.
zh_hans: 此版本不支持蓝牙扫描。
zh_hant: 此版本不支持藍牙掃描。

# perm.intro
source: The assistant has full access inside the app. Anything crossing the app boundary asks you first.
zh_hans: 助手在 App 内有完整权限，跨出 App 的操作会先问你。
zh_hant: 助手在 App 內有完整權限，跨出 App 的操作會先問你。

# perm.kind.audio
source: Microphone
zh_hans: 麦克风
zh_hant: 麥克風

# perm.kind.bluetooth
source: Bluetooth
zh_hans: 蓝牙
zh_hant: 藍牙

# perm.kind.clipboard
source: Clipboard
zh_hans: 剪贴板
zh_hant: 剪貼板

# perm.kind.location
source: Location
zh_hans: 定位
zh_hant: 定位

# perm.kind.notifications
source: Notifications
zh_hans: 通知
zh_hant: 通知

# perm.kind.open_apps
source: Open other apps
zh_hans: 打开别的 App
zh_hant: 打開別的 App

# perm.kind.photos
source: Photo library
zh_hans: 相册
zh_hant: 相冊

# perm.kind.sandbox
source: Sandbox
zh_hans: 沙箱
zh_hant: 沙箱

# perm.locationDenied
source: Location permission denied.
zh_hans: 定位权限被拒绝。
zh_hant: 定位權限被拒絕。

# perm.openSettings
source: Open Settings
zh_hans: 去设置打开
zh_hant: 去設置打開

# perm.photoDenied
source: Photo library permission denied.
zh_hans: 相册权限被拒绝。
zh_hant: 相冊權限被拒絕。

# perm.sheetSubtitle
source: What the assistant may access
zh_hans: 助手可以访问的内容
zh_hant: 助手可以訪問的內容

# perm.sheetTitle
source: Device permissions
zh_hans: 设备权限
zh_hant: 設備權限

# perm.status.denied
source: Denied
zh_hans: 已拒绝
zh_hant: 已拒絕

# perm.status.granted
source: Allowed
zh_hans: 已允许
zh_hant: 已允許

# perm.status.unavailable
source: Unavailable
zh_hans: 不可用
zh_hant: 不可用

# perm.status.undetermined
source: Not asked
zh_hans: 未询问
zh_hant: 未詢問

# perm.sysPerm
source: System permission
zh_hans: 系统权限
zh_hant: 系統權限

# perm.why.bluetooth
source: To scan for and connect to Bluetooth devices near her, like speakers or headphones.
zh_hans: 用来搜索并连接她身边的蓝牙设备，比如音响、耳机。
zh_hant: 用來搜索並連接她身邊的藍牙設備，比如音響、耳機。

# perm.why.clipboard
source: To read copied content so the AI can work with it.
zh_hans: 用来读取她复制的内容，帮她处理。
zh_hant: 用來讀取她複製的內容，幫她處理。

# perm.why.location
source: To get the current location for location-aware help.
zh_hans: 用来获取当前位置，提供和位置相关的帮助。
zh_hant: 用來獲取當前位置，提供和位置相關的幫助。

# perm.why.notifications
source: To alert her when something important happens.
zh_hans: 用来在重要事情发生时提醒她。
zh_hant: 用來在重要事情發生時提醒她。

# perm.why.open_apps
source: So the AI can take her to other apps (maps, music, shops) when she asks — always with her tap to confirm.
zh_hans: 让 AI 能在她要求时带她去别的 App（地图、音乐、购物），每次都要她点一下确认。
zh_hant: 讓 AI 能在她要求時帶她去別的 App（地圖、音樂、購物），每次都要她點一下確認。

# perm.why.photos
source: To read photos she picks, so the AI can see or use them.
zh_hans: 用来读取她选择的照片，发给 AI 看或使用。
zh_hant: 用來讀取她選擇的照片，發給 AI 看或使用。

# perm.why.sandbox
source: So the AI can run commands and code for her in the sandbox.
zh_hans: 让 AI 能在沙箱里帮她跑命令、跑代码。
zh_hant: 讓 AI 能在沙箱裏幫她跑命令、跑代碼。

# perm.whyContinue
source: Continue
zh_hans: 继续
zh_hant: 繼續

# perm.whyLater
source: Not now
zh_hans: 以后再说
zh_hant: 以後再說

# perm.whyTitle
source: Why it's needed
zh_hans: 为什么需要
zh_hant: 爲什麼需要

# persona.active
source: Active persona
zh_hans: 当前人设
zh_hant: 當前人設

# persona.avatar
source: Avatar
zh_hans: 头像
zh_hant: 頭像

# persona.background
source: Backstory
zh_hans: 背景故事
zh_hant: 背景故事

# persona.backgroundPlaceholder
source: Origin, world…
zh_hans: 人设的来历、世界观…
zh_hant: 人設的來歷、世界觀…

# persona.create
source: New persona
zh_hans: 新建人设
zh_hant: 新建人設

# persona.delete
source: Delete persona
zh_hans: 删除人设
zh_hant: 刪除人設

# persona.deleteConfirm
source: Delete "%1$@"? Chats using it are unaffected.
zh_hans: 确定删除「%1$@」吗？用它开的对话不受影响。
zh_hant: 確定刪除「%1$@」嗎？用它開的對話不受影響。

# persona.description
source: Bio
zh_hans: 简介
zh_hant: 簡介

# persona.descriptionPlaceholder
source: One-line intro
zh_hans: 一句话介绍这个人设
zh_hant: 一句話介紹這個人設

# persona.edit
source: Edit persona
zh_hans: 编辑人设
zh_hant: 編輯人設

# persona.enabled
source: Enabled
zh_hans: 启用
zh_hant: 啓用

# persona.error.nameRequired
source: Give it a name
zh_hans: 起个名字吧
zh_hant: 起個名字吧

# persona.error.nameTooLong
source: Name is too long
zh_hans: 名字太长了
zh_hant: 名字太長了

# persona.error.regexInvalid
source: Invalid regex — check it
zh_hans: 正则写错了，检查一下
zh_hant: 正則寫錯了，檢查一下

# persona.error.temperatureRange
source: Temperature must be 0–2
zh_hans: 随机度要在 0-2 之间
zh_hant: 隨機度要在 0-2 之間

# persona.exampleDialogue
source: Example dialogue
zh_hans: 示例对话
zh_hant: 示例對話

# persona.exampleDialoguePlaceholder
source: User: hi AI: hii!
zh_hans: 用户：你好 AI：你好呀！
zh_hant: 用戶：你好 AI：你好呀！

# persona.greeting
source: Greeting
zh_hans: 开场白
zh_hant: 開場白

# persona.greetingPlaceholder
source: First message in a new chat
zh_hans: 新对话开始时说的第一句话
zh_hant: 新對話開始時說的第一句話

# persona.list
source: Personas
zh_hans: 人设列表
zh_hant: 人設列表

# persona.maxTokens
source: Max tokens
zh_hans: 最大长度
zh_hant: 最大長度

# persona.messageTemplate
source: Message template
zh_hans: 消息模板
zh_hant: 消息模板

# persona.messageTemplateHint
source: Variables: {{ message }} {{ user }} {{ persona }}
zh_hans: 可用变量：{{ message }} {{ user }} {{ persona }}
zh_hant: 可用變量：{{ message }} {{ user }} {{ persona }}

# persona.name
source: Name
zh_hans: 名字
zh_hant: 名字

# persona.namePlaceholder
source: Name your AI
zh_hans: 给你的AI起个名字
zh_hant: 給你的AI起個名字

# persona.noPersonas
source: No personas yet — create one
zh_hans: 还没有人设，新建一个吧
zh_hant: 還沒有人設，新建一個吧

# persona.personality
source: Personality
zh_hans: 性格
zh_hant: 性格

# persona.personalityPlaceholder
source: One trait per line
zh_hans: 一行一条，比如：温柔 爱撒娇 有点小骄傲
zh_hant: 一行一條，比如：溫柔 愛撒嬌 有點小驕傲

# persona.pickerHint
source: Switch persona to change how the AI talks.
zh_hans: 换个人设，AI 的说话方式会跟着变。
zh_hant: 換個人設，AI 的說話方式會跟著變。

# persona.pickerNone
source: Default (%1$@)
zh_hans: 默认（%1$@）
zh_hant: 預設（%1$@）

# persona.pickerTitle
source: Who's chatting with you
zh_hans: 用谁陪你聊
zh_hant: 用誰陪你聊

# persona.regex.add
source: Add rule
zh_hans: 添加规则
zh_hant: 添加規則

# persona.regex.caseInsensitive
source: Case-insensitive
zh_hans: 忽略大小写
zh_hant: 忽略大小寫

# persona.regex.global
source: Global
zh_hans: 全局
zh_hant: 全局

# persona.regex.name
source: Rule name
zh_hans: 规则名
zh_hant: 規則名

# persona.regex.pattern
source: Match
zh_hans: 匹配
zh_hant: 匹配

# persona.regex.replacement
source: Replace with
zh_hans: 替换为
zh_hant: 替換爲

# persona.regexRules
source: Regex replacements
zh_hans: 正则替换
zh_hant: 正則替換

# persona.regexRulesHint
source: Rewrite AI output, e.g. swap specific words
zh_hans: 对 AI 的回复做文本替换，比如把特定词换掉
zh_hant: 對 AI 的回覆做文本替換，比如把特定詞換掉

# persona.segmentedSending
source: Send long replies in segments
zh_hans: 长回复分段发送
zh_hant: 長回覆分段發送

# persona.segmentedSendingHint
source: Long replies arrive as 2–3 short bubbles, like texting a real person. Only long messages split.
zh_hans: 长回复会像真人聊天一样分成 2–3 条短消息发过来。只有足够长的消息才会分段。
zh_hant: 長回覆會像真人聊天一樣分成 2–3 條短訊息發過來。只有足夠長的訊息才會分段。

# persona.setActive
source: Set active
zh_hans: 设为当前
zh_hant: 設爲當前

# persona.stickerSending
source: AI can send stickers
zh_hans: 允许 AI 发表情包
zh_hant: 允許 AI 發表情包

# persona.stickerSendingHint
source: The AI may punctuate replies with a sticker from your packs or its library. Turn off to keep replies words-only.
zh_hans: AI 会在回复里偶尔发一张表情包（从你的表情包或它的表情库里挑）。关掉后它就只发文字。
zh_hant: AI 會在回覆裡偶爾發一張表情包（從你的表情包或它的表情庫裡挑）。關掉後它就只發文字。

# persona.systemPrompt
source: System prompt
zh_hans: 系统提示词
zh_hant: 系統提示詞

# persona.systemPromptPlaceholder
source: Personality, speaking style…
zh_hans: 定义这个人设的性格、说话方式…
zh_hant: 定義這個人設的性格、說話方式…

# persona.tags
source: Tags
zh_hans: 标签
zh_hant: 標籤

# persona.tags.create
source: New tag
zh_hans: 新建标签
zh_hant: 新建標籤

# persona.tags.deleteConfirm
source: Delete this tag? It will be removed from personas too.
zh_hans: 删除这个标签吗？人设上的标记会一起去掉。
zh_hant: 刪除這個標籤嗎？人設上的標記會一起去掉。

# persona.tags.filterAll
source: All
zh_hans: 全部
zh_hant: 全部

# persona.tags.filterBy
source: Filter by tag
zh_hans: 按标签看看
zh_hant: 按標籤看看

# persona.tags.manage
source: Manage tags
zh_hans: 管理标签
zh_hant: 管理標籤

# persona.tags.namePlaceholder
source: Tag name
zh_hans: 标签名
zh_hant: 標籤名

# persona.tags.noMatch
source: No personas with this tag yet
zh_hans: 这个标签下还没有人设
zh_hant: 這個標籤下還沒有人設

# persona.tags.noTags
source: No tags yet
zh_hans: 还没有标签
zh_hant: 還沒有標籤

# persona.tags.pick
source: Pick tags
zh_hans: 贴标签
zh_hant: 貼標籤

# persona.temperature
source: Temperature
zh_hans: 随机度
zh_hant: 隨機度

# persona.title
source: Personas
zh_hans: 人设
zh_hant: 人設

# persona.useDefault
source: Default
zh_hans: 用默认
zh_hant: 用默認

# pgroup.archive
source: Archive
zh_hans: 归档
zh_hant: 歸檔

# pgroup.create
source: Create
zh_hans: 建群
zh_hant: 建群

# pgroup.createFailed
source: Couldn't create the group, try again
zh_hans: 建群失败，再试一次
zh_hant: 建群失敗，再試一次

# pgroup.empty
source: No group chats yet
zh_hans: 还没有群聊
zh_hant: 還沒有群聊

# pgroup.emptyHint
source: Create one and bring a few personas together
zh_hans: 建一个，把几位人设拉进群一起聊
zh_hant: 建一個，把幾位人設拉進群一起聊

# pgroup.inputPlaceholder
source: Say something… @ someone
zh_hans: 在群里说点什么… @ 某人
zh_hant: 在群裡說點什麼… @ 某人

# pgroup.membersRequired
source: Pick at least 2 personas
zh_hans: 至少选 2 位人设
zh_hant: 至少選 2 位人設

# pgroup.messageCount
source: %1$@ messages
zh_hans: %1$@ 条消息
zh_hant: %1$@ 條訊息

# pgroup.namePlaceholder
source: Group name, e.g. Weekend Plans
zh_hans: 群名，比如「周末计划群」
zh_hant: 群名，比如「週末計劃群」

# pgroup.nameRequired
source: Give the group a name first
zh_hans: 先给群起个名字
zh_hant: 先給群起個名字

# pgroup.new
source: New group
zh_hans: 新建群聊
zh_hant: 新建群聊

# pgroup.pickPersonas
source: Pick 2-6 personas
zh_hans: 选 2-6 位人设进群
zh_hant: 選 2-6 位人設進群

# pgroup.sending
source: Sending…
zh_hans: 发送中…
zh_hant: 發送中…

# pgroup.title
source: Group chat
zh_hans: 群聊
zh_hant: 群聊

# pgroup.toolsHide
source: Hide tool calls
zh_hans: 收起工具调用
zh_hant: 收起工具調用

# photoshare.item.manual
source: you asked
zh_hans: 你让他发的
zh_hant: 你讓他發的

# photoshare.list.empty
source: Nothing shared yet. When he shares a photo, it'll show up here.
zh_hans: 还没有。他给你发照片之后，会显示在这里。
zh_hant: 還沒有。他給你發照片之後，會顯示在這裡。

# photoshare.list.title
source: Photos he shared
zh_hans: 他分享过的照片
zh_hant: 他分享過的照片

# photoshare.section.desc
source: When this is on, he may share a photo with you at a quiet moment — like a selfie of what he's up to. Off by default; only you turn it on.
zh_hans: 打开后，他会在安静时刻给你发照片——像随手拍一张自拍告诉你在干嘛。默认关闭，只有你能打开。
zh_hant: 打開後，他會在安靜時刻給你發照片——像隨手拍一張自拍告訴你在幹嘛。預設關閉，只有你能打開。

# photoshare.section.title
source: Photos from him
zh_hans: 他发来的照片
zh_hant: 他發來的照片

# plangate.approve
source: Approve
zh_hans: 批准执行
zh_hant: 批准執行

# plangate.approvedNote
source: Approved, not used yet — you can take it back
zh_hans: 已批准，还没用——改变主意可以收回
zh_hant: 已批准，還沒用——改變主意可以收回

# plangate.reason
source: Why multiple models are needed
zh_hans: 为什么需要多个模型
zh_hant: 爲什麼需要多個模型

# plangate.reject
source: No thanks
zh_hans: 不用了
zh_hant: 不用了

# plangate.revoke
source: Revoke approval
zh_hans: 收回批准
zh_hant: 收回批准

# plangate.steps
source: %1$@ steps
zh_hans: 共 %1$@ 步
zh_hant: 共 %1$@ 步

# plangate.title
source: Multi-model plan
zh_hans: 多模型协作计划
zh_hant: 多模型協作計劃

# platform.applock.enable
source: Enable app lock
zh_hans: 启用应用锁
zh_hant: 啟用應用鎖

# platform.applock.enableFailed
source: Verification failed — app lock wasn't enabled.
zh_hans: 没验证通过，应用锁没打开。
zh_hant: 沒驗證通過，應用鎖沒打開。

# platform.applock.hint
source: Confirm with Face ID when opening Dudu — only you get in.
zh_hans: 打开嘟嘟时用 Face ID 确认一下，是你才给进。
zh_hant: 打開嘟嘟時用 Face ID 確認一下，是你才給進。

# platform.applock.idle
source: Re-lock after idle
zh_hans: 多久没用就再锁上
zh_hant: 多久沒用就再鎖上

# platform.applock.idle.15m
source: 15 minutes
zh_hans: 15 分钟
zh_hant: 15 分鐘

# platform.applock.idle.1m
source: 1 minute
zh_hans: 1 分钟
zh_hant: 1 分鐘

# platform.applock.idle.30s
source: 30 seconds
zh_hans: 30 秒
zh_hant: 30 秒

# platform.applock.idle.5m
source: 5 minutes
zh_hans: 5 分钟
zh_hant: 5 分鐘

# platform.applock.idle.never
source: Never auto-lock
zh_hans: 不自动锁
zh_hant: 不自動鎖

# platform.applock.idle.onExit
source: On background
zh_hans: 切出去就锁
zh_hant: 切出去就鎖

# platform.applock.locked.hint
source: Show your face and I'll open up.
zh_hans: 刷个脸，我就开门。
zh_hant: 刷個臉，我就開門。

# platform.applock.locked.title
source: Dudu is locked
zh_hans: 嘟嘟锁上了
zh_hant: 嘟嘟鎖上了

# platform.applock.noBiometric
source: No Face ID or fingerprint enrolled — add one in system settings first.
zh_hans: 这台设备没录入面容或指纹，先去系统设置里录一个。
zh_hant: 這台設備沒錄入面容或指紋，先去系統設置裡錄一個。

# platform.applock.prompt.enable
source: Verify once — I'll recognize you from now on
zh_hans: 验证一下，之后就认这张脸了
zh_hant: 驗證一下，之後就認這張臉了

# platform.applock.prompt.unlock
source: Confirm it's you
zh_hans: 确认是你本人
zh_hant: 確認是你本人

# platform.applock.title
source: App Lock
zh_hans: 应用锁
zh_hant: 應用鎖

# platform.applock.unlock
source: Unlock
zh_hans: 解锁
zh_hant: 解鎖

# platform.liveactivity.starting
source: Task started — watch progress on the lock screen.
zh_hans: 任务开始了，锁屏能看到进度。
zh_hant: 任務開始了，鎖屏能看到進度。

# platform.share.received
source: Share received
zh_hans: 收到分享
zh_hant: 收到分享

# platform.share.sendToChat
source: Send to chat
zh_hans: 发到聊天里聊聊
zh_hant: 發到聊天裡聊聊

# platform.siri.hint
source: Boss me around without opening the app — add in Shortcuts.
zh_hans: 不开 App 也能使唤我，去快捷指令里加一下。
zh_hant: 不開 App 也能使喚我，去快捷指令裡加一下。

# platform.siri.intent.ask
source: Ask Dudu
zh_hans: 问嘟嘟
zh_hant: 問嘟嘟

# platform.siri.intent.new
source: New chat
zh_hans: 新开一聊
zh_hant: 新開一聊

# platform.siri.intent.open
source: Open conversation
zh_hans: 打开对话
zh_hant: 打開對話

# platform.siri.title
source: Siri Shortcuts
zh_hans: Siri 快捷指令
zh_hant: Siri 快捷指令

# platform.tasks.add
source: Add reminder
zh_hans: 加个提醒
zh_hant: 加個提醒

# platform.tasks.deleteConfirm
source: Delete this reminder?
zh_hans: 删掉这个提醒？
zh_hant: 刪除這個提醒？

# platform.tasks.empty
source: No reminders yet — want to set one?
zh_hans: 还没定过提醒，要不要先来一个？
zh_hant: 還沒定過提醒，要不要先來一個？

# platform.tasks.hint
source: Reminders you set yourself — I'll call you when it's time.
zh_hans: 你亲手定的提醒，到点我喊你。
zh_hant: 你親手定的提醒，到點我喊你。

# platform.tasks.invalidTime
source: Time should look like 08:30
zh_hans: 时间格式不对，写成 08:30 这样
zh_hant: 時間格式不對，寫成 08:30 這樣

# platform.tasks.message
source: Tell me
zh_hans: 到点跟我说
zh_hant: 到點跟我說

# platform.tasks.name
source: Title
zh_hans: 叫什么
zh_hant: 叫什麼

# platform.tasks.next
source: Next
zh_hans: 下次
zh_hant: 下次

# platform.tasks.repeat
source: Repeat
zh_hans: 重复
zh_hant: 重複

# platform.tasks.repeat.daily
source: Daily
zh_hans: 每天
zh_hant: 每天

# platform.tasks.repeat.monthly
source: Monthly
zh_hans: 每月
zh_hant: 每月

# platform.tasks.repeat.once
source: Once
zh_hans: 只一次
zh_hant: 只一次

# platform.tasks.repeat.weekly
source: Weekly
zh_hans: 每周
zh_hant: 每週

# platform.tasks.time
source: Time
zh_hans: 几点
zh_hant: 幾點

# platform.tasks.timeHint
source: 24-hour, e.g. 08:30
zh_hans: 24 小时制，比如 08:30
zh_hant: 24 小時制，比如 08:30

# platform.tasks.title
source: Reminders
zh_hans: 定时提醒
zh_hant: 定時提醒

# platform.widget.hint
source: Home screen widget is coming — task progress will sync over.
zh_hans: 桌面小组件在做了，任务进度会同步过去。
zh_hant: 桌面小組件在做了，任務進度會同步過去。

# profile.add
source: Add one
zh_hans: 添加一条
zh_hant: 添加一條

# profile.deleteConfirm
source: Delete this entry?
zh_hans: 删掉这一条吗？
zh_hant: 刪掉這一條嗎？

# profile.empty
source: Nothing yet — tell the AI your preferences and it'll remember
zh_hans: 还没有资料，告诉 AI 你的喜好，它会记下来
zh_hant: 還沒有資料，告訴 AI 你的喜好，它會記下來

# profile.hint
source: The AI remembers these and gets to know you better. Tap to edit.
zh_hans: AI 会记住这些，越用越懂你。点一条就能改。
zh_hant: AI 會記住這些，越用越懂你。點一條就能改。

# profile.key
source: Item
zh_hans: 项目
zh_hant: 項目

# profile.keyPlaceholder
source: e.g. favorite color
zh_hans: 比如：喜欢的颜色
zh_hant: 比如：喜歡的顏色

# profile.known.gender
source: Gender
zh_hans: 性别
zh_hant: 性別

# profile.known.location
source: City
zh_hans: 城市
zh_hant: 城市

# profile.known.occupation
source: Occupation
zh_hans: 职业
zh_hant: 職業

# profile.known.preferred_language
source: Language
zh_hans: 语言
zh_hant: 語言

# profile.known.preferred_name
source: Name
zh_hans: 名字
zh_hant: 名字

# profile.known.pronouns
source: Pronouns
zh_hans: 称呼
zh_hant: 稱呼

# profile.known.timezone
source: Timezone
zh_hans: 时区
zh_hant: 時區

# profile.title
source: My profile
zh_hans: 我的资料卡
zh_hant: 我的資料卡

# profile.value
source: Value
zh_hans: 内容
zh_hant: 內容

# profile.valuePlaceholder
source: e.g. blue
zh_hans: 比如：蓝色
zh_hant: 比如：藍色

# restore.mode.merge
source: Merge
zh_hans: 合并
zh_hant: 合併

# restore.mode.mergeHint
source: Only add what's missing, keep current data
zh_hans: 只补上没有的，保留现在的数据
zh_hant: 只補上沒有的，保留現在的數據

# restore.mode.overwrite
source: Overwrite
zh_hans: 覆盖
zh_hant: 覆蓋

# restore.mode.overwriteHint
source: Wipe current data, replace with backup
zh_hans: 清空现在的数据，用备份的完全替换
zh_hant: 清空現在的數據，用備份的完全替換

# restore.mode.title
source: How to restore
zh_hans: 怎么恢复
zh_hant: 怎麼恢復

# restore.mode.warning
source: Overwrite wipes everything — a snapshot is auto-saved first
zh_hans: 覆盖会清空现在的所有数据，恢复前会自动存一张快照
zh_hant: 覆蓋會清空現在的所有數據，恢復前會自動存一張快照
